cmsis-svd/cmsis-svd/data/Spansion/MB9BF11xS_svd.xml
        <!-- REGISTER "IRQ28MON" -->
        <register>
          <name>IRQ28MON</name>
          <description>IRQ28 Batch Read Register</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3FFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "FRT2INT5" -->
            <field>
              <name>FRT2INT5</name>
              <description>Zero detection interrupt request on the free run timer ch.2 in the MFT unit 2</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "FRT2INT4" -->
            <field>
              <name>FRT2INT4</name>
              <description>Zero detection interrupt request on the free run timer ch.1 in the MFT unit 2</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "FRT2INT3" -->
            <field>
              <name>FRT2INT3</name>
              <description>Zero detection interrupt request on the free run timer ch.0 in the MFT unit 2</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "FRT2INT2" -->
            <field>
              <name>FRT2INT2</name>
              <description>Peak value detection interrupt request on the free run timer ch.2 in the MFT unit 2</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "FRT2INT1" -->
            <field>
              <name>FRT2INT1</name>
              <description>Peak value detection interrupt request on the free run timer ch.1 in the MFT unit 2</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "FRT2INT0" -->
            <field>
              <name>FRT2INT0</name>
              <description>Peak value detection interrupt request on the free run timer ch.0 in the MFT unit 2</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "FRT1INT5" -->
            <field>
              <name>FRT1INT5</name>
              <description>Zero detection interrupt request on the free run timer ch.2 in the MFT unit 1</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "FRT1INT4" -->
            <field>
              <name>FRT1INT4</name>
              <description>Zero detection interrupt request on the free run timer ch.1 in the MFT unit 1</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "FRT1INT3" -->
            <field>
              <name>FRT1INT3</name>
              <description>Zero detection interrupt request on the free run timer ch.0 in the MFT unit 1</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "FRT1INT2" -->
            <field>
              <name>FRT1INT2</name>
              <description>Peak value detection interrupt request on the free run timer ch.2 in the MFT unit 1</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "FRT1INT1" -->
            <field>
              <name>FRT1INT1</name>
              <description>Peak value detection interrupt request on the free run timer ch.1 in the MFT unit 1</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "FRT1INT0" -->
            <field>
              <name>FRT1INT0</name>
              <description>Peak value detection interrupt request on the free run timer ch.0 in the MFT unit 1</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "FRT0INT5" -->
            <field>
              <name>FRT0INT5</name>
              <description>Zero detection interrupt request on the free run timer ch.2 in the MFT unit 0</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "FRT0INT4" -->
            <field>
              <name>FRT0INT4</name>
              <description>Zero detection interrupt request on the free run timer ch.1 in the MFT unit 0</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "FRT0INT3" -->
            <field>
              <name>FRT0INT3</name>
              <description>Zero detection interrupt request on the free run timer ch.0 in the MFT unit 0</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "FRT0INT2" -->
            <field>
              <name>FRT0INT2</name>
              <description>Peak value detection interrupt request on the free run timer ch.2 in the MFT unit 0</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "FRT0INT1" -->
            <field>
              <name>FRT0INT1</name>
              <description>Peak value detection interrupt request on the free run timer ch.1 in the MFT unit 0</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "FRT0INT0" -->
            <field>
              <name>FRT0INT0</name>
              <description>Peak value detection interrupt request on the free run timer ch.0 in the MFT unit 0</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ29MON" -->
        <register>
          <name>IRQ29MON</name>
          <description>IRQ29 Batch Read Register</description>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ICU2INT3" -->
            <field>
              <name>ICU2INT3</name>
              <description>Interrupt request on the input capture ch.3 in the MFT unit 2</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ICU2INT2" -->
            <field>
              <name>ICU2INT2</name>
              <description>Interrupt request on the input capture ch.2 in the MFT unit 2</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ICU2INT1" -->
            <field>
              <name>ICU2INT1</name>
              <description>Interrupt request on the input capture ch.1 in the MFT unit 2</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ICU2INT0" -->
            <field>
              <name>ICU2INT0</name>
              <description>Interrupt request on the input capture ch.0 in the MFT unit 2</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ICU1INT3" -->
            <field>
              <name>ICU1INT3</name>
              <description>Interrupt request on the input capture ch.3 in the MFT unit 1</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ICU1INT2" -->
            <field>
              <name>ICU1INT2</name>
              <description>Interrupt request on the input capture ch.2 in the MFT unit 1</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ICU1INT1" -->
            <field>
              <name>ICU1INT1</name>
              <description>Interrupt request on the input capture ch.1 in the MFT unit 1</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ICU1INT0" -->
            <field>
              <name>ICU1INT0</name>
              <description>Interrupt request on the input capture ch.0 in the MFT unit 1</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ICU0INT3" -->
            <field>
              <name>ICU0INT3</name>
              <description>Interrupt request on the input capture ch.3 in the MFT unit 0</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ICU0INT2" -->
            <field>
              <name>ICU0INT2</name>
              <description>Interrupt request on the input capture ch.2 in the MFT unit 0</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ICU0INT1" -->
            <field>
              <name>ICU0INT1</name>
              <description>Interrupt request on the input capture ch.1 in the MFT unit 0</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ICU0INT0" -->
            <field>
              <name>ICU0INT0</name>
              <description>Interrupt request on the input capture ch.0 in the MFT unit 0</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ30MON" -->
        <register>
          <name>IRQ30MON</name>
          <description>IRQ30 Batch Read Register</description>
          <addressOffset>0x8C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3FFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "OCU2INT5" -->
            <field>
              <name>OCU2INT5</name>
              <description>Interrupt request on the output compare ch.5 in the MFT unit 2</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "OCU2INT4" -->
            <field>
              <name>OCU2INT4</name>
              <description>Interrupt request on the output compare ch.4 in the MFT unit 2</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "OCU2INT3" -->
            <field>
              <name>OCU2INT3</name>
              <description>Interrupt request on the output compare ch.3 in the MFT unit 2</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "OCU2INT2" -->
            <field>
              <name>OCU2INT2</name>
              <description>Interrupt request on the output compare ch.2 in the MFT unit 2</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "OCU2INT1" -->
            <field>
              <name>OCU2INT1</name>
              <description>Interrupt request on the output compare ch.1 in the MFT unit 2</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "OCU2INT0" -->
            <field>
              <name>OCU2INT0</name>
              <description>Interrupt request on the output compare ch.0 in the MFT unit 2</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "OCU1INT5" -->
            <field>
              <name>OCU1INT5</name>
              <description>Interrupt request on the output compare ch.5 in the MFT unit 1</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "OCU1INT4" -->
            <field>
              <name>OCU1INT4</name>
              <description>Interrupt request on the output compare ch.4 in the MFT unit 1</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "OCU1INT3" -->
            <field>
              <name>OCU1INT3</name>
              <description>Interrupt request on the output compare ch.3 in the MFT unit 1</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "OCU1INT2" -->
            <field>
              <name>OCU1INT2</name>
              <description>Interrupt request on the output compare ch.2 in the MFT unit 1</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "OCU1INT1" -->
            <field>
              <name>OCU1INT1</name>
              <description>Interrupt request on the output compare ch.1 in the MFT unit 1</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "OCU1INT0" -->
            <field>
              <name>OCU1INT0</name>
              <description>Interrupt request on the output compare ch.0 in the MFT unit 1</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "OCU0INT5" -->
            <field>
              <name>OCU0INT5</name>
              <description>Interrupt request on the output compare ch.5 in the MFT unit 0 </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "OCU0INT4" -->
            <field>
              <name>OCU0INT4</name>
              <description>Interrupt request on the output compare ch.4 in the MFT unit 0 </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "OCU0INT3" -->
            <field>
              <name>OCU0INT3</name>
              <description>Interrupt request on the output compare ch.3 in the MFT unit 0 </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "OCU0INT2" -->
            <field>
              <name>OCU0INT2</name>
              <description>Interrupt request on the output compare ch.2 in the MFT unit 0 </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "OCU0INT1" -->
            <field>
              <name>OCU0INT1</name>
              <description>Interrupt request on the output compare ch.1 in the MFT unit 0 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "OCU0INT0" -->
            <field>
              <name>OCU0INT0</name>
              <description>Interrupt request on the output compare ch.0 in the MFT unit 0 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ31MON" -->
        <register>
          <name>IRQ31MON</name>
          <description>IRQ31 Batch Read Register</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "BTINT15" -->
            <field>
              <name>BTINT15</name>
              <description>IRQ1 interrupt request on the base timer ch.7</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BTINT14" -->
            <field>
              <name>BTINT14</name>
              <description>IRQ0 interrupt request on the base timer ch.7</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BTINT13" -->
            <field>
              <name>BTINT13</name>
              <description>IRQ1 interrupt request on the base timer ch.6</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BTINT12" -->
            <field>
              <name>BTINT12</name>
              <description>IRQ0 interrupt request on the base timer ch.6</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BTINT11" -->
            <field>
              <name>BTINT11</name>
              <description>IRQ1 interrupt request on the base timer ch.5</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BTINT10" -->
            <field>
              <name>BTINT10</name>
              <description>IRQ0 interrupt request on the base timer ch.5</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BTINT9" -->
            <field>
              <name>BTINT9</name>
              <description>IRQ1 interrupt request on the base timer ch.4</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BTINT8" -->
            <field>
              <name>BTINT8</name>
              <description>IRQ0 interrupt request on the base timer ch.4</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BTINT7" -->
            <field>
              <name>BTINT7</name>
              <description>IRQ1 interrupt request on the base timer ch.3</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BTINT6" -->
            <field>
              <name>BTINT6</name>
              <description>IRQ0 interrupt request on the base timer ch.3</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BTINT5" -->
            <field>
              <name>BTINT5</name>
              <description>IRQ1 interrupt request on the base timer ch.2</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BTINT4" -->
            <field>
              <name>BTINT4</name>
              <description>IRQ0 interrupt request on the base timer ch.2</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BTINT3" -->
            <field>
              <name>BTINT3</name>
              <description>IRQ1 interrupt request on the base timer ch.1</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BTINT2" -->
            <field>
              <name>BTINT2</name>
              <description>IRQ0 interrupt request on the base timer ch.1</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BTINT1" -->
            <field>
              <name>BTINT1</name>
              <description>IRQ1 interrupt request on the base timer ch.0</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BTINT0" -->
            <field>
              <name>BTINT0</name>
              <description>IRQ0 interrupt request on the base timer ch.0</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
